GatePay/loadtest/gd4/evidence/gd4-forged-20260812-001305/gd4-forged-console.log

         /\      Grafana   /ΓÇ╛ΓÇ╛/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ΓÇ╛ΓÇ╛\ 
  /          \   |   (  |  (ΓÇ╛)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: loadtest/paygate/webhook-forged-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 45s max duration (incl. graceful stop):
              * gd4_forged_amount_blast: 10 looping VUs for 15s (gracefulStop: 30s)

k6.exe : time="2026-08-12T00:13:31+07:00" level=info 
msg="{\"event\":\"gd4_forged_setup\",\"runId\":\"gd4-forged-20260812-001305\",\"orderId\":\"ORD-GD4-FORGED-gd4-forged-20260812-001305\",\"expectedAmount\":100000}" source=console
At line:1 char:1
+ & 'C:\Program Files\k6\k6.exe' run --no-color --summary-export "$forg ...
+ ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    + CategoryInfo          : NotSpecified: (time="2026-08-1... source=console:String) [], RemoteException
    + FullyQualifiedErrorId : NativeCommandError
 

running (01.0s), 10/10 VUs, 1582 complete and 0 interrupted iterations
gd4_forged_amount_blast   [   6% ] 10 VUs  01.0s/15s

running (02.0s), 10/10 VUs, 3373 complete and 0 interrupted iterations
gd4_forged_amount_blast   [  13% ] 10 VUs  02.0s/15s

running (03.0s), 10/10 VUs, 5275 complete and 0 interrupted iterations
gd4_forged_amount_blast   [  20% ] 10 VUs  03.0s/15s

running (04.0s), 10/10 VUs, 7175 complete and 0 interrupted iterations
gd4_forged_amount_blast   [  26% ] 10 VUs  04.0s/15s

running (05.0s), 10/10 VUs, 8935 complete and 0 interrupted iterations
gd4_forged_amount_blast   [  33% ] 10 VUs  05.0s/15s

running (06.0s), 10/10 VUs, 10495 complete and 0 interrupted iterations
gd4_forged_amount_blast   [  40% ] 10 VUs  06.0s/15s

running (07.0s), 10/10 VUs, 12015 complete and 0 interrupted iterations
gd4_forged_amount_blast   [  46% ] 10 VUs  07.0s/15s

running (08.0s), 10/10 VUs, 13585 complete and 0 interrupted iterations
gd4_forged_amount_blast   [  53% ] 10 VUs  08.0s/15s

running (09.0s), 10/10 VUs, 15155 complete and 0 interrupted iterations
gd4_forged_amount_blast   [  60% ] 10 VUs  09.0s/15s

running (10.0s), 10/10 VUs, 16605 complete and 0 interrupted iterations
gd4_forged_amount_blast   [  66% ] 10 VUs  10.0s/15s

running (11.0s), 10/10 VUs, 18189 complete and 0 interrupted iterations
gd4_forged_amount_blast   [  73% ] 10 VUs  11.0s/15s

running (12.0s), 10/10 VUs, 19829 complete and 0 interrupted iterations
gd4_forged_amount_blast   [  80% ] 10 VUs  12.0s/15s

running (13.0s), 10/10 VUs, 21359 complete and 0 interrupted iterations
gd4_forged_amount_blast   [  86% ] 10 VUs  13.0s/15s

running (14.0s), 10/10 VUs, 22727 complete and 0 interrupted iterations
gd4_forged_amount_blast   [  93% ] 10 VUs  14.0s/15s

running (15.0s), 10/10 VUs, 24257 complete and 0 interrupted iterations
gd4_forged_amount_blast   [ 100% ] 10 VUs  15.0s/15s


  Γûê THRESHOLDS 

    checks
    Γ£ô 'rate==1' rate=100.00%

    gd4_forged_duration
    Γ£ô 'p(95)<1000' p(95)=6.25722

    gd4_forged_exact_reject_rate
    Γ£ô 'rate==1' rate=100.00%


  Γûê TOTAL RESULTS 

    checks_total.......: 97268   6470.634066/s
    checks_succeeded...: 100.00% 97268 out of 97268
    checks_failed......: 0.00%   0 out of 97268

    Γ£ô forged amount returns exact HTTP 400 Amount mismatch
    Γ£ô forged amount is never accepted
    Γ£ô forged amount is not rejected by HMAC authentication
    Γ£ô forged amount does not cause a server error

    CUSTOM
    gd4_forged_duration..................: avg=4.739368 min=2.5834 med=4.5249 max=22.5688 p(90)=5.79106 p(95)=6.25722
    gd4_forged_exact_mismatch_rejected...: 24317   1617.658517/s
    gd4_forged_exact_reject_rate.........: 100.00% 24317 out of 24317

    HTTP
    http_req_duration....................: avg=4.73ms   min=2.58ms med=4.52ms max=22.56ms p(90)=5.79ms  p(95)=6.25ms 
      { expected_response:true }.........: avg=4.73ms   min=2.58ms med=4.52ms max=22.56ms p(90)=5.79ms  p(95)=6.25ms 
    http_req_failed......................: 0.00%   0 out of 24318
    http_reqs............................: 24318   1617.72504/s

    EXECUTION
    iteration_duration...................: avg=6.15ms   min=3.61ms med=5.97ms max=24.13ms p(90)=7.49ms  p(95)=8.01ms 
    iterations...........................: 24317   1617.658517/s
    vus..................................: 10      min=10             max=10
    vus_max..............................: 10      min=10             max=10

    NETWORK
    data_received........................: 13 MB   848 kB/s
    data_sent............................: 12 MB   787 kB/s



running (15.0s), 00/10 VUs, 24317 complete and 0 interrupted iterations
gd4_forged_amount_blast Γ£ô [ 100% ] 10 VUs  15s